In [55]:
import pandas as pd

In [56]:
df = pd.DataFrame(columns=['Name', 'Age', 'Height'])
df

Empty DataFrame
Columns: [Name, Age, Height]
Index: []

In [57]:
df.loc[0] = ['Allen', 22, 175]
df.loc[1] = ['Ted', 25, 180]
df.loc[2] = ['Jack', 28, 177]
df

    Name  Age  Height
0  Allen   22     175
1    Ted   25     180
2   Jack   28     177

In [58]:
df['Age']

0    22
1    25
2    28
Name: Age, dtype: int64

In [59]:
df['Weight'] = [75, 80, 85]
df

    Name  Age  Height  Weight
0  Allen   22     175      75
1    Ted   25     180      80
2   Jack   28     177      85

In [60]:
df.drop('Weight', axis=1)   # 預覽 drop後的表格,並未真的drop
                            # 參數axis維度 預設0=index那欄  1 = columns那列  設定在該維度尋找想drop的東西

    Name  Age  Height
0  Allen   22     175
1    Ted   25     180
2   Jack   28     177

In [61]:
df                                  # 預覽 drop後的表格,並未真的drop

    Name  Age  Height  Weight
0  Allen   22     175      75
1    Ted   25     180      80
2   Jack   28     177      85

In [62]:
df = df.drop('Weight', axis=1)

In [63]:
df

    Name  Age  Height
0  Allen   22     175
1    Ted   25     180
2   Jack   28     177

In [64]:
df = df.drop(2)

In [65]:
df

    Name  Age  Height
0  Allen   22     175
1    Ted   25     180

In [66]:
df['Height'] = [180, 185]
df

    Name  Age  Height
0  Allen   22     180
1    Ted   25     185

In [67]:
df['Height'] = 190      # 如果全部都要修改成同一個值的話
df

    Name  Age  Height
0  Allen   22     190
1    Ted   25     190

In [68]:
columns = ['Name', 'Age', 'Height']
data = [
    ['Jake', 26, 180],
    ['Trump', 23, 185]
]

df2 = pd.DataFrame(
    data = data,
    columns = columns
)
df2

    Name  Age  Height
0   Jake   26     180
1  Trump   23     185

In [69]:
df_union = pd.concat(             # 兩個 Table 上下合併
    [df, df2]
)

df_union

    Name  Age  Height
0  Allen   22     190
1    Ted   25     190
0   Jake   26     180
1  Trump   23     185

In [70]:
df_union = pd.concat(
    [df, df2]
).reset_index(drop=True)             # 重新設置index (參數 True = 刪除舊的)

df_union

    Name  Age  Height
0  Allen   22     190
1    Ted   25     190
2   Jake   26     180
3  Trump   23     185

In [71]:
df_union.to_csv('basic.csv')            # 將檔案存成 CSV 檔 (檔案名稱)

In [72]:
df_union.to_csv('basic.csv', index=False)    # 不把 index 存進檔案裡

In [73]:
df_union.to_csv('basic_no_columns.csv', index=False, header=None)   # 欄位也不存進檔案

In [74]:
df

    Name  Age  Height
0  Allen   22     190
1    Ted   25     190

In [75]:
df_replica = df.copy()         # 建立備份 ， 因為在pandas中 不能用另外一個變數進行備份
                               # pandas 會將他們視為同一個記憶體

In [76]:
df['Age'] = 28
df

    Name  Age  Height
0  Allen   28     190
1    Ted   28     190

In [77]:
df_replica

    Name  Age  Height
0  Allen   22     190
1    Ted   25     190